# -*- org-confirm-babel-evaluate: nil; -*-
#+OPTIONS: html-postamble:nil html-preamble:nil
** How to run this as a build script
:PROPERTIES:
:CUSTOM_ID: build-html.org
:END:

How about tangling it out as an elisp script and then run it from the command line with emacs batch?

* Raw code to tangle out
** First let's set up the css and javascript imports
 #+BEGIN_SRC emacs-lisp :results silent
   (setq cssjs "<link rel='stylesheet' type='text/css' href='../css/css/htmlize.css'>

                <script type='text/javascript' src='../../jsLibraries/jquery.min.js'></script>
                <script type='text/javascript' src='../../jsLibraries/bootstrap.bundle.min.js'></script>
                <script type='text/javascript' src='../css/js/readtheorg.js'></script>")
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :results silent
   (setq cssjs "<link>") 
 #+END_SRC

** Reset a lot of the default html output
** Initialize the publishing properties
How do you force all org files to be rebuilt when this function has been changed?  Normally only the org-mode files that have been changed are rebuilt.

"Org uses [[http://orgmode.org/guide/Publishing.html][timestamps]] to track when a file has changed. The above functions normally only publish changed files. You can override this and force publishing of all files by giving a prefix argument to any of the commands above."

#+BEGIN_SRC emacs-lisp :results silent 
  (setq org-publish-project-alist '(("build-html" 
                                     :base-directory "."                           ; This file must be at the root of the org project.
                                     :base-extension "org"                         ; Only process org-mode files.
                                     :publishing-directory "../publish-html"
                                     :publishing-function org-html-publish-to-html
                                     :section-numbers nil
                                     :with-toc nil
                                     :html-extension "html"
                                     :html-head-include-scripts nil                ; Do not include the default javascript.
                                     :html-head-include-default-style nil          ; Do not include the default css styles.
                                     :html-html5-fancy t                           ; Supposedly this is required for HTML5 output.
                                     :html-doctype "html5"                         ; And yes, render out HTML5.
                                     :recursive t)))
#+END_SRC


#+BEGIN_SRC emacs-lisp :results silent 
  (org-publish-current-project)
#+END_SRC

* Function checks
#+BEGIN_SRC emacs-lisp
  (stringp "<link>")
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (print org-html-container-element)
  (print org-html-divs)
#+END_SRC

#+RESULTS:
| preamble  | div | preamble  |
| content   | div | content   |
| postamble | div | postamble |
